#include <iostream>
#include <qaz_kosu_kosu.h>

қолдану кеңістік стандартты_кіріспе;

елбасы() {
    // Кодты мында енгізіңіз

    // Тез cұрыптау функциясының қолданылу мысалы
    вектор_сан v = { 9, 7, 2, 3, 700, 0, -91, 91, 10, -5 };
    тез_сұрыптау(v);
    төңкеру(барлығы(v));
    үшін(сан i = 0; i < v.ұзындығы(); i++) {
        шығыс << v[i] << " ";
    }
    шығыс << жаңа_жол;

    // Бинарлы дәрежеге шығару мысалы
    сан x = 127;
    сан y = 25;
    шығыс << бинарлы_дәреже(x, y) << жаңа_жол;

    қайтару 0;
}
