#include <qaz_kosu_kosu.h>

қолдану кеңістік стандартты_кіріспе;

құрылыс Мәселе {
  вектор<жол> сандар;
  вектор<ұзын> ұзындар;
  тексеріс қосу;
};

вектор<жол> жолдарды_алу() {
  вектор<жол> жолдар;
  жол жол_жеке;
  while(std::getline(std::cin, жол_жеке)) {
    жолдар.артқа_қосу(жол_жеке);
  }
  қайтару жолдар;
}

сан бос_баған(вектор<жол> жолдар, сан баған) {
  үшін (сан i=0; i<жолдар.ұзындығы(); ++i) if (жолдар[i][баған] != ' ') қайтару жалған;
  қайтару ақиқат;
}

вектор<Мәселе> мәселелерді_алу() {
  вектор<жол> жолдар = жолдарды_алу();
  вектор<Мәселе> мәселелер;

  сан жолдар_саны = жолдар.ұзындығы();
  сан бағандар_саны = жолдар[0].ұзындығы();

  сан индекс = 0;
  үшін (сан i=0; i<бағандар_саны; ++i) {
    if (!бос_баған(жолдар, i) && i != бағандар_саны-1) жалғастыру;
    вектор<жол> сандар;
    вектор<ұзын> ұзындар;
    сан ұзындығы = i == бағандар_саны-1 ? i-индекс + 1 : i-индекс;
    // Амал қабатын елемеу
    үшін (сан j=0; j<жолдар_саны-1; ++j) {
      жол сан = жолдар[j].жоласты(индекс, ұзындығы);
      сандар.артқа_қосу(сан);
      ұзындар.артқа_қосу(stol(сан));
    }
    жол амал_жолы = жолдар[жолдар_саны-1].жоласты(индекс, ұзындығы);
    тексеріс қосу = амал_жолы.іздеу('+') != жол::npos;

    индекс = i + 1;
    мәселелер.артқа_қосу({ сандар, ұзындар, қосу });
  }
  қайтару мәселелер;
}

void бірінші_бөлім(вектор<Мәселе> мәселелер) {
  сан жол_нөмірі = 0;
  ұзын жалпы = 0;

  үшін (сан i=0; i<мәселелер.ұзындығы(); ++i) {
    Мәселе мәселе = мәселелер[i];
    ұзын мән = мәселе.ұзындар[0];
    үшін (сан j=1; j<мәселе.ұзындар.ұзындығы(); ++j) {
      if (мәселе.қосу) мән += мәселе.ұзындар[j];
      else мән *= мәселе.ұзындар[j];
    }
    жалпы += мән;
  }
  cout << "Бірінші бөлім: " << жалпы << endl;
}

ұзын мәселені_шешу(Мәселе мәселе) {
  сан жолдар_саны = мәселе.сандар.ұзындығы();
  сан бағандар_саны = мәселе.сандар[0].ұзындығы();
  вектор<жол> сандар(бағандар_саны);

  үшін (сан i=0; i<бағандар_саны; ++i) {
    үшін (сан j=0; j<жолдар_саны; ++j) {
      if (мәселе.сандар[j][i] == ' ') жалғастыру;
      сандар[i] += мәселе.сандар[j][i];
    }
  }

  ұзын жалпы = stol(сандар[0]);
  үшін (сан i=1; i<сандар.ұзындығы(); ++i) {
    if (мәселе.қосу) жалпы += stol(сандар[i]);
    else жалпы *= stol(сандар[i]);
  }
  қайтару жалпы;
  қайтару 0;
}

void екінші_бөлім(вектор<Мәселе> мәселелер) {
  ұзын жалпы = 0;
  үшін (сан i=0; i<мәселелер.ұзындығы(); ++i) {
    жалпы += мәселені_шешу(мәселелер[i]);
  }
  cout << "Екінші бөлім: " << жалпы << endl;
}

елбасы() {
  вектор<Мәселе> мәселелер = мәселелерді_алу();
  бірінші_бөлім(мәселелер);
  екінші_бөлім(мәселелер);
  қайтару 0;
}
